Revit 2026 API

# SpatialElementCalculationPointPosition Property

---

The position of the "in" spatial element calculation point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Position { get; set; }
```
```vb
Public Property Position As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Position : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This is the search point where a family instance will be considered to be located inside a room/space.

#### Reference

SpatialElementCalculationPoint Class

Autodesk.Revit.DB Namespace